joristork/robots/jobot_in_c/microchip_extras/h/p18f86k90.h
extern volatile far  unsigned char       RTCVAL;
extern volatile far  unsigned char       RTCVALL;
extern volatile far  unsigned char       RTCVALH;
extern volatile far  union {
  struct {
    unsigned RTCVALH:8;
  };
  struct {
    unsigned WAITE0:1;
    unsigned WAITE1:1;
    unsigned WAITM0:1;
    unsigned WAITM1:1;
    unsigned WAITM2:1;
    unsigned WAITM3:1;
    unsigned WAITB0:1;
    unsigned WAITB1:1;
  };
} RTCVALHbits;
extern volatile far  unsigned char       RTCCAL;
extern volatile far  union {
  struct {
    unsigned CAL:8;
  };
  struct {
    unsigned CAL0:1;
    unsigned CAL1:1;
    unsigned CAL2:1;
    unsigned CAL3:1;
    unsigned CAL4:1;
    unsigned CAL5:1;
    unsigned CAL6:1;
    unsigned CAL7:1;
  };
} RTCCALbits;
extern volatile far  unsigned char       RTCCFG;
extern volatile far  union {
  struct {
    unsigned RTCPTR:2;
    unsigned RTCOE:1;
    unsigned HALFSEC:1;
    unsigned RTCSYNC:1;
    unsigned RTCWREN:1;
    unsigned :1;
    unsigned RTCEN:1;
  };
  struct {
    unsigned RTCPTR0:1;
    unsigned RTCPTR1:1;
  };
} RTCCFGbits;
extern volatile near unsigned char       PIE6;
extern volatile near struct {
  unsigned CMP1IE:1;
  unsigned CMP2IE:1;
  unsigned CMP3IE:1;
  unsigned :1;
  unsigned EEIE:1;
} PIE6bits;
extern volatile near unsigned char       EEDATA;
extern volatile near unsigned char       EEADR;
extern volatile near unsigned char       EEADRH;
extern volatile near unsigned char       OSCCON2;
extern volatile near struct {
  unsigned MFIOSEL:1;
  unsigned MFIOFS:1;
  unsigned :1;
  unsigned SOSCGO:1;
  unsigned :2;
  unsigned SOSCRUN:1;
} OSCCON2bits;
extern volatile near unsigned char       BAUDCON;
extern volatile near struct {
  unsigned ABDEN:1;
  unsigned WUE:1;
  unsigned :1;
  unsigned BRG16:1;
  unsigned TXCKP:1;
  unsigned RXDTP:1;
  unsigned RCIDL:1;
  unsigned ABDOVF:1;
} BAUDCONbits;
extern volatile near unsigned char       BAUDCON1;
extern volatile near struct {
  unsigned ABDEN:1;
  unsigned WUE:1;
  unsigned :1;
  unsigned BRG16:1;
  unsigned TXCKP:1;
  unsigned RXDTP:1;
  unsigned RCIDL:1;
  unsigned ABDOVF:1;
} BAUDCON1bits;
extern volatile near unsigned char       BAUDCTL;
extern volatile near struct {
  unsigned ABDEN:1;
  unsigned WUE:1;
  unsigned :1;
  unsigned BRG16:1;
  unsigned TXCKP:1;
  unsigned RXDTP:1;
  unsigned RCIDL:1;
  unsigned ABDOVF:1;
} BAUDCTLbits;
extern volatile near unsigned char       LCDDATA0;
extern volatile near struct {
  unsigned S00C0:1;
  unsigned S01C0:1;
  unsigned S02C0:1;
  unsigned S03C0:1;
  unsigned S04C0:1;
  unsigned S05C0:1;
  unsigned S06C0:1;
  unsigned S07C0:1;
} LCDDATA0bits;
extern volatile near unsigned char       LCDDATA1;
extern volatile near struct {
  unsigned S08C0:1;
  unsigned S09C0:1;
  unsigned S10C0:1;
  unsigned S11C0:1;
  unsigned S12C0:1;
  unsigned S13C0:1;
  unsigned S14C0:1;
  unsigned S15C0:1;
} LCDDATA1bits;
extern volatile near unsigned char       LCDDATA2;
extern volatile near struct {
  unsigned S16C0:1;
  unsigned S17C0:1;
  unsigned S18C0:1;
  unsigned S19C0:1;
  unsigned S20C0:1;
  unsigned S21C0:1;
  unsigned S22C0:1;
  unsigned S23C0:1;
} LCDDATA2bits;
extern volatile near unsigned char       LCDDATA3;
extern volatile near struct {
  unsigned S24C0:1;
  unsigned S25C0:1;
  unsigned S26C0:1;
  unsigned S27C0:1;
  unsigned S28C0:1;
  unsigned S29C0:1;
  unsigned S30C0:1;
  unsigned S31C0:1;
} LCDDATA3bits;
extern volatile near unsigned char       LCDDATA4;
extern volatile near struct {
  unsigned S32C0:1;
  unsigned S33C0:1;
  unsigned S34C0:1;
  unsigned S35C0:1;
  unsigned S36C0:1;
  unsigned S37C0:1;
  unsigned S38C0:1;
  unsigned S39C0:1;
} LCDDATA4bits;
extern volatile near unsigned char       LCDDATA5;
extern volatile near struct {
  unsigned S40C0:1;
  unsigned S41C0:1;
  unsigned S42C0:1;
  unsigned S43C0:1;
  unsigned S44C0:1;
  unsigned S45C0:1;
  unsigned S46C0:1;
  unsigned S47C0:1;
} LCDDATA5bits;
extern volatile near unsigned char       LCDDATA6;
extern volatile near struct {
  unsigned S00C1:1;
  unsigned S01C1:1;
  unsigned S02C1:1;
  unsigned S03C1:1;
  unsigned S04C1:1;
  unsigned S05C1:1;
  unsigned S06C1:1;
  unsigned S07C1:1;
} LCDDATA6bits;
extern volatile near unsigned char       LCDDATA7;
extern volatile near struct {
  unsigned S08C1:1;
  unsigned S09C1:1;
  unsigned S10C1:1;
  unsigned S11C1:1;
  unsigned S12C1:1;
  unsigned S13C1:1;
  unsigned S14C1:1;
  unsigned S15C1:1;
} LCDDATA7bits;
extern volatile near unsigned char       LCDDATA8;
extern volatile near struct {
  unsigned S16C1:1;
  unsigned S17C1:1;
  unsigned S18C1:1;
  unsigned S19C1:1;
  unsigned S20C1:1;
  unsigned S21C1:1;
  unsigned S22C1:1;
  unsigned S23C1:1;
} LCDDATA8bits;
extern volatile near unsigned char       LCDDATA9;
extern volatile near struct {
  unsigned S24C1:1;
  unsigned S25C1:1;
  unsigned S26C1:1;
  unsigned S27C1:1;
  unsigned S28C1:1;
  unsigned S29C1:1;
  unsigned S30C1:1;
  unsigned S31C1:1;
} LCDDATA9bits;
extern volatile near unsigned char       LCDDATA10;
extern volatile near struct {
  unsigned S32C1:1;
  unsigned S33C1:1;
  unsigned S34C1:1;
  unsigned S35C1:1;
  unsigned S36C1:1;
  unsigned S37C1:1;
  unsigned S38C1:1;
  unsigned S39C1:1;
} LCDDATA10bits;
extern volatile near unsigned char       LCDDATA11;
extern volatile near struct {
  unsigned S40C1:1;
  unsigned S41C1:1;
  unsigned S42C1:1;
  unsigned S43C1:1;
  unsigned S44C1:1;
  unsigned S45C1:1;
  unsigned S46C1:1;
  unsigned S47C1:1;
} LCDDATA11bits;
extern volatile near unsigned char       LCDDATA12;
extern volatile near struct {
  unsigned S00C2:1;
  unsigned S01C2:1;
  unsigned S02C2:1;
  unsigned S03C2:1;
  unsigned S04C2:1;
  unsigned S05C2:1;
  unsigned S06C2:1;
  unsigned S07C2:1;
} LCDDATA12bits;
extern volatile near unsigned char       LCDDATA13;
extern volatile near struct {
  unsigned S08C2:1;
  unsigned S09C2:1;
  unsigned S10C2:1;
  unsigned S11C2:1;
  unsigned S12C2:1;
  unsigned S13C2:1;
  unsigned S14C2:1;
  unsigned S15C2:1;
} LCDDATA13bits;
extern volatile near unsigned char       LCDDATA14;
extern volatile near struct {
  unsigned S16C2:1;
  unsigned S17C2:1;
  unsigned S18C2:1;
  unsigned S19C2:1;
  unsigned S20C2:1;
  unsigned S21C2:1;
  unsigned S22C2:1;
  unsigned S23C2:1;
} LCDDATA14bits;
